Revit 2027 API
Transform2D.OfPoint Method
 Applies the transformation to the point and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV OfPoint(
	UV point
)
Public Function OfPoint (
	point As UV
) As UV
public:
UV^ OfPoint(
	UV^ point
)
member OfPoint :
        point : UV -> UV
Parameters
point UV
 The point to transform.
Return Value
UV
 The transformed point.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Transformation of a point is affected by the translational part of the transformation.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace